ekhpascal/HillGrov/rescue/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_HG_ROLE_ZONE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BT_ENABLED=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xE000
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC_SIZE=0x100
# Default 9000 ms is shorter than the 10 s rescue-button hold (Task 15):
# the RTC WDT would reset the chip mid-hold (reset loop) or mid-nvs-erase.
# (rescue's own bootloader artifact is never flashed, but Task 15 pins this
# the same across all three apps' bootloader configs for consistency.)
CONFIG_BOOTLOADER_WDT_TIME_MS=30000
# Pull/upload can each run tens of seconds; give the TWDT the same headroom.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_VERSION_1=y
# Size levers (task 16 brief): no IPv6, no WPA-enterprise, no HTTPS client --
# rescue only ever does plain-HTTP pulls and a local WPA2-PSK AP.
CONFIG_LWIP_IPV6=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
